import React from "react";
import style from "./index.module.scss";
import blog1 from "@/assets/front/images/blog/blog-single.jpg";
import post1 from "@/assets/front/images/blog/rp-1.jpg";
import post2 from "@/assets/front/images/blog/rp-2.jpg";
import post3 from "@/assets/front/images/blog/rp-3.jpg";
import post4 from "@/assets/front/images/blog/rp-4.jpg";
import addBann from "@/assets/front/images/blog/ban-add.jpg";
import Layout from "@/components/front/include/Layout";
import Image from "next/image";
import parse from "html-react-parser";
import Link from "next/link";

import { CiCalendar } from "react-icons/ci";
import { FiUser } from "react-icons/fi";

const BlogSingle = () => {
  const relatedPosts = [
    {
      imgSrc: post1,
      title: "שנה את התזונה שלך עם ארוחה אורגנית",
      description: "הוא פשוט טקסט דמה של תעשיית הדפוס והקביעה.",
    },
    {
      imgSrc: post2,
      title: "שנה את התזונה שלך עם ארוחה אורגנית",
      description: "הוא פשוט טקסט דמה של תעשיית הדפוס והקביעה.",
    },
    {
      imgSrc: post3,
      title: "שנה את התזונה שלך עם ארוחה אורגנית",
      description: "הוא פשוט טקסט דמה של תעשיית הדפוס והקביעה.",
    },
    {
      imgSrc: post4,
      title: "שנה את התזונה שלך עם ארוחה אורגנית",
      description: "הוא פשוט טקסט דמה של תעשיית הדפוס והקביעה.",
    },
  ];

  return (
    <Layout>
      <section className={style.blogSingle}>
        <div className={`container-fluid ${style.blogSingleContainer}`}>
          <div className="row">
            <div className="col-lg-8 col-md-8 col-sm-8 col-12">
              <div className={style.blogBlock}>
                <div className={style.blogImg}>
                  <Image alt="" src={blog1} width={0} height={0} />
                </div>
                <div className={style.blogContent}>
                  <div className={style.blogMeta}>
                    <a href="#">
                      <FiUser /> By Frutin{" "}
                    </a>
                    <a href="#">
                      <CiCalendar /> 21 March, 2024
                    </a>
                  </div>
                  <h3 className={style.boxTitle}>
                    <a href="#">שנה את התזונה שלך עם ארוחה אורגנית</a>
                  </h3>
                  {parse(
                    "<p>ותי מבלי לפרוץ את הכיס ושינוי פרדיגמת המזון  לא יכול להיות מזין, טעים ובעל ערכים  פלבורית הוקמה כפתרון חסכוני, טבעי, ארצי וישראלי במטרה לספק לאנשים אוכל איכותי מבלי לפרוץ את הכיס ושינוי פרדיגמת המזון  לא יכול להיות מזין, טעים ובעל ערכים תזונתיים גבוהים.פלבורית הוקמה כפתרון חסכוני, טבעי, ארצי וישראלי במטרה לספק לאנשים אוכל איכותי מבלי לפרוץ את הכיס ושינוי פרדיגמת המזון  לא יכול להיות מזין, טעים ובעל ערכים תזונתיים גבוהים.פלבורית הוקמה כפתרון חסכוני, טבעי, ארצי וישראלי במטרה לספק לאנשים אוכל איכותי מבלי לפרוץ את הכיס ושינוי פרדיגמת המזון  לא יכול להיות מזין, טעים ובעל ערכים תזונתיים גבוהים.פלבורית הוקמה כפתרון חסכוני, טבעי, ארצי וישראלי במטרה לספק לאנשים אוכל איכותי מבלי לפרוץ את הכיס ושינוי פרדיגמת המזון  לא יכול להיות מזין, טעים ובעל ערכים תזונתיים גבוהים.פלבורית הוקמה כפתרון חסכוני, טבעי, ארצי וישראלי במטרה לספק לאנשים אוכל איכותי מבלי לפרוץ את הכיס ושינוי פרדיגמת המזון  לא יכול להיות מזין, טעים ובעל ערכים תזונתיים גבוהים.פלבורית הוקמה כפתרון חסכוני, טבעי, ארצי וישראלי במטרה לספק לאנשים אוכל איכותי מבלי לפרוץ את הכיס ושינוי פרדיגמת המזון  לא יכול להיות מזין, טעים ובעל ערכים תזונתיים גבוהים.תזונתיים גבוהים.כפתרון חסכוני, טבעי, ארצי וישראלי במטרה לספק לאנשים אוכל איכותי מבלי לפרוץ את הכיס ושינוי פרדיגמת המזון  לא יכול להיות מזין, טעים ובעל ערכים תזונתיים גבוהים.פלבורית הוקמה כפתרון חסכוני, טבעי, ארצי וישראלי במטרה לספק לאנשים אוכל איכותי מבלי לפרוץ את הכיס ושינוי פרדיגמת המזון  לא יכול להיות מזין, טעים ובעל ערכים תזונתיים גבוהים.פלבורית הוקמה כפתרון חסכוני, טבעי, ארצי וישראלי במטרה לספק לאנשים אוכל איכותי מבלי לפרוץ את הכיס ושינוי פרדיגמת המזון  לא יכול להיות מזין, טעים ובעל ערכים תזונתיים גבוהים.תזונתיים גבוהים. ותי מבלי לפרוץ את הכיס ושינוי פרדיגמת המזון  לא יכול להיות מזין, טעים ובעל ערכים  פלבורית הוקמה כפתרון חסכוני, טבעי, ארצי וישראלי במטרה לספק לאנשים אוכל איכותי מבלי לפרוץ את הכיס ושינוי פרדיגמת המזון  לא יכול להיות מזין, טעים ובעל ערכים תזונתיים גבוהים.פלבורית הוקמה כפתרון חסכוני, טבעי, ארצי וישראלי במטרה לספק לאנשים אוכל איכותי מבלי לפרוץ את הכיס ושינוי פרדיגמת המזון  לא יכול להיות מזין, טעים ובעל ערכים תזונתיים גבוהים.פלבורית הוקמה כפתרון חסכוני, טבעי, ארצי וישראלי במטרה לספק לאנשים אוכל איכותי מבלי לפרוץ את הכיס ושינוי פרדיגמת המזון  לא יכול להיות מזין, טעים ובעל ערכים תזונתיים גבוהים.פלבורית הוקמה כפתרון חסכוני, טבעי, ארצי וישראלי במטרה לספק לאנשים אוכל איכותי מבלי לפרוץ את הכיס ושינוי פרדיגמת המזון  לא יכול להיות מזין, טעים ובעל ערכים תזונתיים גבוהים.פלבורית הוקמה כפתרון חסכוני, טבעי, ארצי וישראלי במטרה לספק לאנשים אוכל איכותי מבלי לפרוץ את הכיס ושינוי פרדיגמת המזון  לא יכול להיות מזין, טעים ובעל ערכים תזונתיים גבוהים.פלבורית הוקמה כפתרון חסכוני, טבעי, ארצי וישראלי במטרה לספק לאנשים אוכל איכותי מבלי לפרוץ את הכיס ושינוי פרדיגמת המזון  לא יכול להיות מזין, טעים ובעל ערכים תזונתיים גבוהים.תזונתיים גבוהים.כפתרון חסכוני, טבעי, ארצי וישראלי במטרה לספק לאנשים אוכל איכותי מבלי לפרוץ את הכיס ושינוי פרדיגמת המזון  לא יכול להיות מזין, טעים ובעל ערכים תזונתיים גבוהים.פלבורית הוקמה כפתרון חסכוני, טבעי, ארצי וישראלי במטרה לספק לאנשים אוכל איכותי מבלי לפרוץ את הכיס ושינוי פרדיגמת המזון  לא יכול להיות מזין, טעים ובעל ערכים תזונתיים גבוהים.פלבורית הוקמה כפתרון חסכוני, טבעי, ארצי וישראלי במטרה לספק לאנשים אוכל איכותי מבלי לפרוץ את הכיס ושינוי פרדיגמת המזון  לא יכול להיות מזין, טעים ובעל ערכים תזונתיים גבוהים.תזונתיים גבוהים.</p>"
                  )}
                </div>
              </div>
            </div>
            <div className="col-lg-4 col-md-4 col-sm-4 col-12">
              <div className={style.relatedPost}>
                <h3>פוסט קשור</h3>
                <div className={style.relatedPostInner}>
                  {relatedPosts.map((post, index) => (
                    <Link
                      key={index}
                      href="#"
                      className={`d-flex align-items-center ${style.relatedList}`}
                    >
                      <div className={style.rightImg}>
                        <Image alt="" src={post.imgSrc} width={0} height={0} />
                      </div>
                      <div className={style.leftContent}>
                        <h5>{post.title}</h5>
                        {parse(`<p>${post.description}</p>`)}
                      </div>
                    </Link>
                  ))}
                </div>
                <div className={style.addBanner}>
                  <Image alt="" src={addBann} width={0} height={0} />
                </div>
              </div>
            </div>
          </div>
        </div>
      </section>
    </Layout>
  );
};

export default BlogSingle;
